# MassPerUnitLength Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..MassPerUnitLength Property
SpecTypeId Class See Also
---
Mass per Unit Length, in discipline Structural.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId MassPerUnitLength { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MassPerUnitLength As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MassPerUnitLength {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace